Revit 2023 API
CurveNode Class
 An output node that represents a model curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public class CurveNode : ModelCurveNode
Visual Basic
Public Class CurveNode _
	Inherits ModelCurveNode
Visual C++
public ref class CurveNode : public ModelCurveNode
Remarks
 See also: OnCurve(CurveNode).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.CurveNode
See Also
CurveNode Members
Autodesk.Revit.DB Namespace